/***************************************************************************
名    称： delay.C
功    能： 子函数定义
作    者： H&G
版    本： V1.0
创建时间： 2011-6-10
***************************************************************************/

/***************************************************************************
名    称：void delay_us(unsigned int time)
功    能：延迟
入口参数：time   延迟时间
出口参数：无
说    明：具体延迟时间与系统时钟频率有关
调用方法：delay_us(100);
***************************************************************************/

void delay_us(unsigned int time)
 {     
   while (time--);
 }		  


/***************************************************************************
名    称：void delay_ms(unsigned int time)
功    能：延迟
入口参数：time   延迟时间
出口参数：无
说    明：具体延迟时间与系统时钟频率有关
调用方法：delay_ms(100);
***************************************************************************/
void delay_ms(unsigned int time)
	 {
	  while(time--) delay_us(100);  		 
	 }

/***************************************************************************
名    称：void delay(unsigned long time)
功    能：延迟
入口参数：time   延迟时间
出口参数：无
说    明：具体延迟时间与系统时钟频率有关
调用方法：delay(100);
***************************************************************************/	 
void delay( unsigned long time)
{
	 unsigned int i = 0;

	while(time--)
	{
		for (i = 0; i < 2; i++)
		{}
	}
}

/***************************************************************************
***************************************************************************/