/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved
*		
* 软件作者:	骑飞家族
* 版权所有: 骑飞电子	
* 创建日期:	2010年6月10日 
* 软件历史:	2010年11月2日修改
* Version:  1.0 
* Demo 淘宝地址：http://store.taobao.com/shop/view_shop.htm?asker=wangwang&shop_nick=qifeidianzi
**********************************************************************************************************************************************
懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒
懒懒懒懒懒懒懒懒懒懒懒一懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒困一懒懒懒懒懒懒懒懒懒懒懒懒懒懒一一一一一一一懒懒懒懒懒懒懒
懒懒困一一一一懒一一一一一一二懒懒懒懒困一一一一一一一一懒懒懒懒懒懒懒懒懒四厲懒懒一一懒懒懒一懒懒懒懒懒懒懒懒懒一一一一四四一一一懒懒懒懒懒懒
懒懒懒懒懒懒一懒懒懒一二一懒懒懒懒懒懒一一一一四厲二一四懒一一懒懒懒懒懒四一一一一一一一一一一一懒懒懒懒懒懒懒懒四懒懒四一一一一厲懒懒懒懒懒懒
懒懒懒四厲厲一懒懒厲懒懒懒四懒懒懒懒懒懒懒懒懒懒懒困一懒一一懒懒懒懒懒懒懒一一厲厲一一厲厲厲一一懒懒懒懒懒懒厲厲厲厲厲厲一一厲厲厲懒懒懒懒懒懒
懒懒懒一懒二一一一一一一一一一一一懒懒懒懒懒懒懒懒二一一困懒懒懒懒懒懒懒懒一一一一一一一一一一四懒懒懒懒懒一一一一一一一一一一一一一一一懒懒懒
懒懒懒一一一一一厲二一一厲一懒厲懒懒懒懒懒懒懒懒懒一一一一一懒懒懒懒懒懒懒一一懒懒一一懒懒懒一困懒懒懒懒懒一一四懒懒懒懒一一懒懒困一一四懒懒懒
懒懒懒懒懒懒懒一困一懒一厲一懒懒懒懒懒懒懒懒懒懒懒困一懒懒一一懒懒懒懒懒懒一一一一一一一一一一厲懒懒懒懒懒懒懒懒懒懒懒懒一一厲懒懒懒懒懒懒懒懒
懒二一一一懒四困厲一一一厲一懒懒懒懒懒懒懒懒懒懒懒懒一一懒懒懒懒懒懒懒懒懒懒懒懒懒四一厲懒懒懒懒懒懒一懒懒懒懒懒懒懒懒懒一一厲懒懒懒懒懒懒懒懒
懒懒懒懒懒懒一懒懒懒懒懒一一懒懒懒懒懒懒懒懒懒懒懒懒厲一一一一一一困懒懒懒懒懒懒懒懒一一一一一一一一一懒懒懒懒懒困懒懒厲一一懒懒懒懒懒懒懒懒懒
懒懒懒懒一一一懒懒困一一一一懒懒懒懒懒懒懒懒懒懒懒懒懒懒一一一一一懒懒懒懒懒懒懒懒懒懒一一一一一一一懒懒懒懒懒懒懒一一一一四懒懒懒懒懒懒懒懒懒
懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒懒
**********************************************************************************************************************************************/
//
/***************************************************************************
名    称： TFT.h
功    能： 宏定义及子函数声名等
作    者： H&G
版    本： V1.0
创建时间： 2011-6-10
***************************************************************************/

/***************************************************************************
							  说明
采用C8051F系列单片机控制TFT显示，TFT被设置成8位工作模式
文件中设置了TFT颜色常量
文件中规定了TFT与C8051F单片机的连接方式
文件中声名了TFT显示用函数
***************************************************************************/

#ifndef TFT_H
#define TFT_H

/***************************************************************************
头文件
***************************************************************************/
#include <C8051F340.h>

/***************************************************************************
TFT 颜色定义
***************************************************************************/
#define	BLACK	0x0000
#define	BLUE	0x001F
#define	RED 	0xF800
#define	GREEN 	0x07E0
#define CYAN	0x07FF
#define MAGENTA 0xF81F
#define YELLOW	0xFFE0
#define WHITE	0xFFFF		

/***************************************************************************
TFT 模式定义
***************************************************************************/
#define AM         011  //011
#define BGR        1

/***************************************************************************
TFT 端口定义
***************************************************************************/
#define Port4    P4
#define Port4MDOUT    P4MDOUT


//TFT 数据线，TFT被设置成8位模式  
//P4^7-----------------D15    高位
//P1^6-----------------D14
//P4^5-----------------D13
//P4^4-----------------D12
//P4^3-----------------D11
//P4^2-----------------D10
//P4^1-----------------D9
//P4^0-----------------D8

/***************************************************************************
TFT 控制线定义
***************************************************************************/
 
//sbit Tft_CS_PIN=P2^6;//片选控制端  直接接地
sbit Tft_RS_PIN=P2^4;//RS=1，数据；RS=0，指令
sbit Tft_WR_PIN=P2^6;//上升沿写数据入
sbit Tft_RD_PIN=P2^5;//上升沿读出数据
sbit Tft_RST_PIN=P2^3;//复位端
sbit Tft_BLK_PIN=P2^7;//背光

/***************************************************************************
子函数声名
***************************************************************************/
void Tft_Init(void);
unsigned int Tft_ReadID(void);
void TftClear(unsigned int Color);
void TftWrite16(unsigned int index);
unsigned int BGR2RGB(unsigned int color);
void Tft_WR_DATA16(unsigned int inputdata);
void TftWrite(unsigned int index,unsigned int inputdata);
void Tft_SetCursor(unsigned int Xpos, unsigned int Ypos);
unsigned int Tft_ReadPoint(unsigned int Xpos,unsigned int Ypos);
void TftWR_SingleStr(unsigned char inputdata,unsigned int color,unsigned int xcolor);
void TftWR_Str(unsigned int x,unsigned int y,unsigned char *s,unsigned int color,unsigned int xcolor);
void Tft_SetBackground(unsigned int StartX,unsigned int StartY,unsigned int LongX,unsigned int LongY);


#endif   
                              
/***************************************************************************
***************************************************************************/